app/Http/Controllers/UserController.php

select * from `users` where `users`.`id` = '11' limit 1
---
    public function edit(string $id)
    {
        $families = $this->familyModel->all();

        return view('layouts.users.form', [
            'user' => $this->userModel->find($id),
            'title' => 'User Edit',
            'families' => $families
        ]);