app/Http/Controllers/UserController.php

    public function index()
    {
        $users = $this->model->with('family')->get();
---
select * from `families`

    public function create()
    {
        return view('layouts.users.form', [
            'title' => 'User Create',
            'families' => Family::get()
        ]);
---
select * from `families`
select * from `users`

    public function edit(string $id)
    {
        return view('layouts.users.form', [
            'user' => $this->model->find($id),
            'title' => 'User Edit',
            'families' => Family::get()
        ]);
---
select * from `users` where `users`.`id` = '6' limit 1
select * from `families`